---
kind: type
id: T:Autodesk.Revit.DB.Structure.ReinforcementRoundingSource
source: html/95b4476e-50d0-a6bb-a062-91ca34d9bada.htm
---
# Autodesk.Revit.DB.Structure.ReinforcementRoundingSource

An enumerated type listing the possible sources for reinforcement rounding overrides.

## Syntax (C#)
```csharp
public enum ReinforcementRoundingSource
```